<?php

namespace App\Features\Role\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $permissions = [

            /*
            |--------------------------------------------------------------------------
            | Brand Permissions
            |--------------------------------------------------------------------------
            */

            'عرض العلامات التجارية',
            'إضافة علامة تجارية',
            'تعديل علامة تجارية',
            'حذف علامة تجارية',

            /*
            |--------------------------------------------------------------------------
            | Category Permissions
            |--------------------------------------------------------------------------
            */

            'عرض الفئات',
            'إضافة فئة',
            'تعديل الفئة',
            'حذف الفئة',

            /*
            |--------------------------------------------------------------------------
            | Country Permissions
            |--------------------------------------------------------------------------
            */
            'عرض الدول',
            'إضافة دولة',
            'تعديل الدولة',
            'حذف الدولة',

            /*
            |--------------------------------------------------------------------------
            | City Permissions
            |--------------------------------------------------------------------------
            */

            'عرض المدن',
            'إضافة مدينة',
            'تعديل المدينة',
            'حذف المدينة',

            /*
            |--------------------------------------------------------------------------
            | Complaint Permissions
            |--------------------------------------------------------------------------
            */

            'عرض الشكاوى',
            'الرد على الشكاوى',
            'حذف الشكاوى',

            /*
            |--------------------------------------------------------------------------
            | Contact Message Permissions
            |--------------------------------------------------------------------------
            */

            'عرض رسائل التواصل',
            'الرد على رسائل التواصل',
            'حذف رسائل التواصل',

            /*
            |--------------------------------------------------------------------------
            | Customer Repair Request Permissions
            |--------------------------------------------------------------------------
            */

            'عرض طلبات الصيانة',
            'حذف طلبات الصيانة',
            'الموافقة على طلبات الصيانة',
            'رفض طلبات الصيانة',

            /*
            |--------------------------------------------------------------------------
            | Device Model Permissions
            |--------------------------------------------------------------------------
            */

            'عرض الأجهزة',
            'إضافة جهاز',
            'تعديل جهاز',
            'حذف جهاز',

            /*
            |--------------------------------------------------------------------------
            | Feature Shop Permissions
            |--------------------------------------------------------------------------
            */

            'عرض ميزات المتجر',
            'إضافة ميزة للمتجر',
            'تعديل ميزة للمتجر',
            'حذف ميزة للمتجر',

            /*
            |--------------------------------------------------------------------------
            | Product Permissions
            |--------------------------------------------------------------------------
            */

            'عرض المنتجات',
            'إضافة منتج',
            'تعديل منتج',
            'حذف منتج',

            /*
            |--------------------------------------------------------------------------
            | Review Permissions
            |--------------------------------------------------------------------------
            */

            'حذف تعليق تقييم',
            'عرض تقييمات الورشة',
            'الرد على التقييم',
            'عرض تقييمات جميع الورش',

            /*
            |--------------------------------------------------------------------------
            | Role Permissions
            |--------------------------------------------------------------------------
            */

            'عرض الأدوار',
            'إضافة دور',
            'تعديل دور',
            'حذف دور',
            'عرض صلاحيات الدور',
            'إضافة صلاحية للدور',
            'إزالة صلاحية من الدور',

            /*
            |--------------------------------------------------------------------------
            | Service Permissions
            |--------------------------------------------------------------------------
            */

            'عرض الخدمات',
            'إضافة خدمة',
            'تعديل خدمة',
            'حذف خدمة',
            /*
|--------------------------------------------------------------------------
| Shop Owner Permissions
|--------------------------------------------------------------------------
*/

            'عرض أصحاب الورش',
            'تجميد حساب صاحب الورشة',
            'فك تجميد حساب صاحب الورشة',
            'حذف حساب صاحب الورشة',
            'إضافة طلب تحقق صاحب الورشة',
            'عرض طلبات تحقق أصحاب الورش',
            'الموافقة على طلب تحقق صاحب الورشة',
            'رفض طلب تحقق صاحب الورشة',
            'حذف طلب تحقق صاحب الورشة',
            'تعديل ملف الورشة',
            'عرض ملف الورشة',

            /*
|--------------------------------------------------------------------------
| Shop Product Permissions
|--------------------------------------------------------------------------
*/

            'عرض منتجات الورشة',
            'إضافة منتج للورشة',
            'تعديل منتج الورشة',
            'حذف منتج الورشة',

            /*
|--------------------------------------------------------------------------
| Account Deletion Reason Permissions
|--------------------------------------------------------------------------
*/

            'تفعيل وإلغاء تفعيل أسباب حذف الحساب',


        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate([
                'name' => $permission,
                'guard_name' => 'web',
            ]);
        }
    }
}